import numpy as np

tactile_parameter = {
    "tactile_bound" : [
        np.array([[870, 291], [1330, 1070], [1422, 1070], [905, 291]], dtype=np.int32),
        np.array([], dtype=np.int32),
        np.array([], dtype=np.int32)
    
    ],
    "safe_bound" : [
        np.array([[850, 290], [1185, 1070], [1520, 1070], [940, 290]], dtype=np.int32),
        np.array([[701, 345], [748, 345], [528, 993], [269, 993]], dtype=np.int32),
        np.array([[1050, 376], [1136, 376], [1568, 925], [1292, 950]], dtype=np.int32)
    ],
    "blocks_bound" : [
        np.array([
                    [[1113, 894], [1186, 1067], [1513, 1067], [1386, 894]],
                    [[1021, 680], [1113, 894], [1386, 894], [1228, 680]],
                    [[966, 554], [1017, 672], [1219, 672], [1134, 554]],
                    [[927, 463], [966, 554], [1134, 554], [1065, 463]],
                    [[898, 393], [927, 463], [1065, 463], [1013, 393]],
                    [[887, 366], [898, 393], [1013, 393], [993, 366]],
                    [[872, 332], [887, 366], [993, 366], [968, 332]],
                    [[856, 294], [872, 332], [968, 332], [938, 294]],], dtype=np.int32),
        np.array([], dtype=np.int32),
        np.array([], dtype=np.int32)           
    ]
}

'''
tactile_bound: 為每個畫面中導盲磚的邊界座標

safe_bound: 為每個畫面中安全區的邊界座標，偏離此範圍會觸發偏離矯正，範圍比tactile_bound大

blocks_bound: 為每個畫面中導盲磚的區塊座標，每個導盲磚範圍被切成多個區塊，用在BLE定位
'''